avrdudes/avr-libc/include/avr/ioavr32la32.h
/* ADC.CTRLE  bit masks and bit positions */
#define ADC_SAMPDUR_gm  0xFF  /* Sample Duration group mask. */
#define ADC_SAMPDUR_gp  0  /* Sample Duration group position. */
#define ADC_SAMPDUR_0_bm  (1<<0)  /* Sample Duration bit 0 mask. */
#define ADC_SAMPDUR_0_bp  0  /* Sample Duration bit 0 position. */
#define ADC_SAMPDUR_1_bm  (1<<1)  /* Sample Duration bit 1 mask. */
#define ADC_SAMPDUR_1_bp  1  /* Sample Duration bit 1 position. */
#define ADC_SAMPDUR_2_bm  (1<<2)  /* Sample Duration bit 2 mask. */
#define ADC_SAMPDUR_2_bp  2  /* Sample Duration bit 2 position. */
#define ADC_SAMPDUR_3_bm  (1<<3)  /* Sample Duration bit 3 mask. */
#define ADC_SAMPDUR_3_bp  3  /* Sample Duration bit 3 position. */
#define ADC_SAMPDUR_4_bm  (1<<4)  /* Sample Duration bit 4 mask. */
#define ADC_SAMPDUR_4_bp  4  /* Sample Duration bit 4 position. */
#define ADC_SAMPDUR_5_bm  (1<<5)  /* Sample Duration bit 5 mask. */
#define ADC_SAMPDUR_5_bp  5  /* Sample Duration bit 5 position. */
#define ADC_SAMPDUR_6_bm  (1<<6)  /* Sample Duration bit 6 mask. */
#define ADC_SAMPDUR_6_bp  6  /* Sample Duration bit 6 position. */
#define ADC_SAMPDUR_7_bm  (1<<7)  /* Sample Duration bit 7 mask. */
#define ADC_SAMPDUR_7_bp  7  /* Sample Duration bit 7 position. */

/* ADC.CTRLF  bit masks and bit positions */
#define ADC_SAMPNUM_gm  0x0F  /* Sample Accumulation Number Select group mask. */
#define ADC_SAMPNUM_gp  0  /* Sample Accumulation Number Select group position. */
#define ADC_SAMPNUM_0_bm  (1<<0)  /* Sample Accumulation Number Select bit 0 mask. */
#define ADC_SAMPNUM_0_bp  0  /* Sample Accumulation Number Select bit 0 position. */
#define ADC_SAMPNUM_1_bm  (1<<1)  /* Sample Accumulation Number Select bit 1 mask. */
#define ADC_SAMPNUM_1_bp  1  /* Sample Accumulation Number Select bit 1 position. */
#define ADC_SAMPNUM_2_bm  (1<<2)  /* Sample Accumulation Number Select bit 2 mask. */
#define ADC_SAMPNUM_2_bp  2  /* Sample Accumulation Number Select bit 2 position. */
#define ADC_SAMPNUM_3_bm  (1<<3)  /* Sample Accumulation Number Select bit 3 mask. */
#define ADC_SAMPNUM_3_bp  3  /* Sample Accumulation Number Select bit 3 position. */
#define ADC_SCALING_gm  0x30  /* Result Scaling group mask. */
#define ADC_SCALING_gp  4  /* Result Scaling group position. */
#define ADC_SCALING_0_bm  (1<<4)  /* Result Scaling bit 0 mask. */
#define ADC_SCALING_0_bp  4  /* Result Scaling bit 0 position. */
#define ADC_SCALING_1_bm  (1<<5)  /* Result Scaling bit 1 mask. */
#define ADC_SCALING_1_bp  5  /* Result Scaling bit 1 position. */
#define ADC_FREERUN_bm  0x40  /* Free Running bit mask. */
#define ADC_FREERUN_bp  6  /* Free Running bit position. */

/* ADC.INTCTRL  bit masks and bit positions */
#define ADC_RESRDY_bm  0x01  /* Result Ready Interrupt Enable bit mask. */
#define ADC_RESRDY_bp  0  /* Result Ready Interrupt Enable bit position. */
#define ADC_SAMPRDY_bm  0x02  /* Sample Ready Interrupt Enable bit mask. */
#define ADC_SAMPRDY_bp  1  /* Sample Ready Interrupt Enable bit position. */
#define ADC_WCMP_bm  0x04  /* Window Comparator Interrupt Enable bit mask. */
#define ADC_WCMP_bp  2  /* Window Comparator Interrupt Enable bit position. */
#define ADC_RESOVR_bm  0x08  /* Result Overwrite Interrupt Enable bit mask. */
#define ADC_RESOVR_bp  3  /* Result Overwrite Interrupt Enable bit position. */
#define ADC_SAMPOVR_bm  0x10  /* Sample Overwrite Interrupt Enable bit mask. */
#define ADC_SAMPOVR_bp  4  /* Sample Overwrite Interrupt Enable bit position. */
#define ADC_TRIGOVR_bm  0x20  /* Trigger Overrun Interrupt Enable bit mask. */
#define ADC_TRIGOVR_bp  5  /* Trigger Overrun Interrupt Enable bit position. */

/* ADC.INTFLAGS  bit masks and bit positions */
/* ADC_RESRDY  is already defined. */
/* ADC_SAMPRDY  is already defined. */
/* ADC_WCMP  is already defined. */
/* ADC_RESOVR  is already defined. */
/* ADC_SAMPOVR  is already defined. */
/* ADC_TRIGOVR  is already defined. */

/* ADC.STATUS  bit masks and bit positions */
#define ADC_ADCBUSY_bm  0x01  /* ADC Busy bit mask. */
#define ADC_ADCBUSY_bp  0  /* ADC Busy bit position. */

/* ADC.DBGCTRL  bit masks and bit positions */
#define ADC_DBGRUN_bm  0x01  /* Run in Debug Mode bit mask. */
#define ADC_DBGRUN_bp  0  /* Run in Debug Mode bit position. */

/* ADC.COMMAND  bit masks and bit positions */
#define ADC_START_gm  0x07  /* Start Conversion group mask. */
#define ADC_START_gp  0  /* Start Conversion group position. */
#define ADC_START_0_bm  (1<<0)  /* Start Conversion bit 0 mask. */
#define ADC_START_0_bp  0  /* Start Conversion bit 0 position. */
#define ADC_START_1_bm  (1<<1)  /* Start Conversion bit 1 mask. */
#define ADC_START_1_bp  1  /* Start Conversion bit 1 position. */
#define ADC_START_2_bm  (1<<2)  /* Start Conversion bit 2 mask. */
#define ADC_START_2_bp  2  /* Start Conversion bit 2 position. */
#define ADC_MODE_gm  0x70  /* Mode group mask. */
#define ADC_MODE_gp  4  /* Mode group position. */
#define ADC_MODE_0_bm  (1<<4)  /* Mode bit 0 mask. */
#define ADC_MODE_0_bp  4  /* Mode bit 0 position. */
#define ADC_MODE_1_bm  (1<<5)  /* Mode bit 1 mask. */
#define ADC_MODE_1_bp  5  /* Mode bit 1 position. */
#define ADC_MODE_2_bm  (1<<6)  /* Mode bit 2 mask. */
#define ADC_MODE_2_bp  6  /* Mode bit 2 position. */

/* ADC.MUXPOS  bit masks and bit positions */
#define ADC_MUXPOS_gm  0x7F  /* Positive Input Multiplexer group mask. */
#define ADC_MUXPOS_gp  0  /* Positive Input Multiplexer group position. */
#define ADC_MUXPOS_0_bm  (1<<0)  /* Positive Input Multiplexer bit 0 mask. */
#define ADC_MUXPOS_0_bp  0  /* Positive Input Multiplexer bit 0 position. */
#define ADC_MUXPOS_1_bm  (1<<1)  /* Positive Input Multiplexer bit 1 mask. */
#define ADC_MUXPOS_1_bp  1  /* Positive Input Multiplexer bit 1 position. */
#define ADC_MUXPOS_2_bm  (1<<2)  /* Positive Input Multiplexer bit 2 mask. */
#define ADC_MUXPOS_2_bp  2  /* Positive Input Multiplexer bit 2 position. */
#define ADC_MUXPOS_3_bm  (1<<3)  /* Positive Input Multiplexer bit 3 mask. */
#define ADC_MUXPOS_3_bp  3  /* Positive Input Multiplexer bit 3 position. */
#define ADC_MUXPOS_4_bm  (1<<4)  /* Positive Input Multiplexer bit 4 mask. */
#define ADC_MUXPOS_4_bp  4  /* Positive Input Multiplexer bit 4 position. */
#define ADC_MUXPOS_5_bm  (1<<5)  /* Positive Input Multiplexer bit 5 mask. */
#define ADC_MUXPOS_5_bp  5  /* Positive Input Multiplexer bit 5 position. */
#define ADC_MUXPOS_6_bm  (1<<6)  /* Positive Input Multiplexer bit 6 mask. */
#define ADC_MUXPOS_6_bp  6  /* Positive Input Multiplexer bit 6 position. */

